---
kind: other
id: Methods.T:Autodesk.Revit.DB.RepeatingReferenceSource
source: html/b3b1d3ee-047b-e73b-2375-8084af6a013a.htm
---
# RepeatingReferenceSource Methods

Returns information about the boundaries of the repeating reference array.